[
  {
    "question": "المفرود اتمرن كام يوم في الاسبوع؟",
    "ground_truth":" خليني اقولك انك عندك مساحة و مرونة تختار فيها عدد الايام المناسب لاسلوب حياتك. عندك من اول ٣ ايام لحد ٦ ايام تروح تتمرن فيهم.",
    "docsource": "training_guide"
  },
  {
    "question": "اسخن ازاي قبل التمرين؟",
    "ground_truth": "# التسخين ## بتسخن كويس؟ من اكثر المشاكل و الاخطاء ناس كثير بتقع فيها و هي التسخين. لو مسخنتش كويس قبل التمرين هتلاقي نفسك معرض لاصابات كتير، مفاصلك بتوجعك و بتاثر عليك وقت التمرين و غير كل ده هتلاقي نفسك مش عارف تادي كويس في النص الاول من تمرينتك لحد ما جسمك يسخن و تدخل في مود التمرين. طيب اسخن ازاي؟ عندك اربع خطوات للتسخين --- # اول خطوة درجة حرارة جسمك. لو انت داخل تتمرن مينفعش انك تدخل علي اوزان تقيلة و جسمك نفسه مش مستعد للتمرين. علشان كدة لازم تسخن حرارة جسمك بالمشي علي الترید ميل او العجلة من 10-5 دقائق لحد ما تحس ان جسمك سخن معاك, وقتها هندخل علي الخطوة اللي بعدها. # تاني خطوة تسخين المفاصل. لو مسخنتش مفاصلك هتلاقي مفاصلك بتوجعك في تمارين كتير و ده اكيد هياثر علي ادائك نفسه. علشان كدة من اهم الخطوات هي تسخين مفاصلك زي الريست, الكوع و مفصل الكتف. بتقف و بتمسك ايدك المفصل ليدك التانية و تبتدي تحرك مفصل ايدك ده في شكل دائري ٢٠ عدة لكل يد, هتحس بفرق جامد اثناء تمرينك # ثالث خطوة تسخين اوتار الكتف. هتلاقي جملة Rotator cuff منتشرة علي لسان اي حد بيروح يتمرن. دي هي اوتار الكتف و لو انت مسخنتهمش كويس هتعرض نفسك للاصابة في كتفك اثناء التمرين. طيب ازاي اسخنهم صح؟ يفضل تستخدم كابل عندك في الجيم, بتثبت الكابل علي مستوي كوعك و تمسك - زي ما باين في الصورة تحت. استخدم External Rotation وزن خفيف و العب 10 القبضة و تعمل ٢٠ عدة. --- # رابع خطوة تسخين العضلة المستهدفة. كدة انت سخنت جسمك بشكل عام، دلوقتي محتاج تسخن العضلة المستهدفة قبل ما تبتدي التمرين. بتشوف اول تمرينة انت هتلعبها و قبل ما تبتدي التمرين بوزن تقيل، بتسخن مجموعتين او ثلاث مجاميع بوزن خفيف تزوده تدريجيا. كمثال، لو بتلعب في تمرينتك ب ٢٠ كيلو، سخن اول مجموعة ب ١٠ كيلو و بعدها ب ١٢ كيلو او الوزن المتوفر عندك بعدها و بعد كدة اخر مجموعة ب ١٥ كيلو مثلا. بكدة تكون انت خلصت التسخين بتاعك، خد نفسك او ريح و اول ما تحس انك جاهز ! ابتدي تمرينتك لحد اللحظة دي انت المفروض تمام الخطوة اللي جاية هتقف محتار و مش عارف تتصرف ازاي. --- # 3. ازاي تختار الوزن بتاعك اعتقد ده من اهم الاسئلة اللي انت محتاج اجابتها، خليني اقولك ان فيه اكثر من اسلوب تقدر تستخدمه علشان تختار الوزن بتاعك، هشرحلك كل اسلوب. و في الاخر هقولك افضل اسلوب تقدر تستخدمه # 1 REP MAX (RM) يعتبر الاسلوب ده من الاساليب المتعارف عليها من زمان خصوصا لو عايز تعرف مدي قوتك و قدرتك على رفع الاوزان الثقيلة. بكل بساطة الفكرة اللي وراها هي انك بتحدد تمرين معين و بتختبر قوتك فيه بانك تشوف ايه اثقل وزن تقدر تشيله باداء حركي كامل و صح لعدة واحدة. و على اساس النتيجة دي ممكن كل فترة تعيد التجربة و تشوف هل قوتك بتزيد ولا لا. طبعا لو شيلت وزن اثقل ف. كدة قوتك بتزيد طيب ايه علاقة ده بيك؟ هتلاقي بعض المدربين بيستخدموا الاسلوب ده مع المتدربين، بحيث انه عدد من التمارين و يقولك اختبر ال RM يحددلك 1 بتاعك فيهم، بعدها بتستخدم الوزن الناتج عنه و تضربه في 80 % و ده يبقي الوزن المناسب ليك .لاستخدامه في التمرين ده يعتبر الاسلوب ده من افضل الاساليب لو انت هدفك هو قياس القوة بتاعك و لكن له اسباب كثير تخليني .اقولك انه مش افضل اسلوب تستخدمه في تمرينك **اول سبب**، هو انك بتزود فرص الاصابة عندك .خصوصا لو انت مبتدئ او اول مرة تجرب الاختبار ده **تاني سبب**، هو وضع حمل شديد على جهازك العصبي و عضلاتك من ارهاق و ده طبعا هياثر عليك .في ادائك في التمرين **ثالث سبب**، هو الوقت. مينفعش انك تستخدم الاسلوب ده في كل التمارين و ال موضوع هياخد منك وقت مضاعف في الاول لحد ما تعرف تتقنه و تتعود عليه، علشان كده هو ممكن ميبقاش مناسب ليك او لاي شخص هدفه الاساسي هو زيادة الكتلة --- بكل بساطه هتستخدم جهاز ال CALCULATOR 1 RM هنا بتختار التمرين اللي انت حابب تشوف ال 1RM بتاعك فيه و بتجيب وزن تقدر تلعب بيه 3-6 عدات. بعدها بتاخد الوزن ده و تحطه في ال CALCULATOR هيحسبلك بالتقريب اثقل وزن تقدر تلعب بيه عدة واحده هيكون ايه. لو عايز تحسب ال RM1 بتاعك بطريقه امنه اضغط هنا لو حابب تقرا اكثر عن 1RM اضغط هنا تعمل اى لو عايز تحسيل 1RM بتاعك من غير ما تعرض نفسك للاصابة؟ --- # REPS IN RESERVE (RIR) من افضل الاساليب المستخدمة حاليا هو ال Reps in Reserve. خليني اشرحلك ايه هو و ازاي تعرف تطبقه. الموضوع باختصار هو عبارة عن قربك او وصولك للفشل العضلي. بمعني، لو انت دلوقتي لعبت في تمرينة معينة لحد ما جبت اخرك او بمعني تاني الفشل العضلي (هنقول ١٠عدات)، بكدة هتبقي انت خلصت كل العدات بتاعتك اللي تعرف تلعبها. يعني مفيش اي عدة عندك في التانك كان ممكن تلعبها و ملعبتهاش، و بكدة انت ال RIR بتاعك كام؟ صفر. انت خلصت كل العدات الممكنة و وصلت للفشل العضلي. يبقي كدة RIR 0 معناه الفشل العضلي. طيب لو انت بدل ما تلعب ال ١٠ عدات دول لعبت ٩عدات بس و وقفت؟ كدة انت في عدة كان ممكن تلعبها و توصل للفشل العضلي بس انت ملعبتهاش. شايف العدة ال- انت سبتها دي؟ خليتك بعيد عن الفشل العضلي بعدة و بكدة انت سيبتها عدة في التانك عندك، كدة ال RIR بتاعك كام؟ ١. طيب لو وقفت عند ٨ عدات؟ يبقي انت كدة كنت بعيد عن الفشل العضلي بعدتين يعني ال RIR بتاعك ٢. بكده مفروض تكون فهمت ان كل ما ال RIR رقمه يزيد كل ما انت بتبعد عن الفشل العضلي. --- # ازاي تطبق ال RIR ؟ بكل بساطة هتختار وزن انت شايفه مناسب لنطاق العدات اللي انا كاتبهولك، هتجرب تلعب بيه و تخلي شخص واقف معاك للحماية فقط لو انت احتاجت و تلعب لحد ما تجيب اخرك. لحد ما توصل للفشل العضلي، لو لعبت و وصلت للفشل العضلي في النطاق اللي انا كاتبه يبقي كدة انت مختار وزن صح و هتلعب بيه بعد كدة من غير ما توصل للفشل العضلي (هتسيب من عدة لثلاثة) عندك في التانك. لو وصلت للفشل العضلي بعد النطاق اللي انا كاتبه، يبقي الوزن ده خفيف و هتحتاج تستخدم وزن اثقل. لو وصلت للفشل العضلي قبل النطاق اللي انا كاتبه، يبقي الوزن تقيل بزيادة v خففه درجة و العب بيه. # RATED PERCEIVED EXERTION (RPE) ده اخر اسلوب هكلمك عليه و هو نفس الفكرة بالظبط زي ال RIR و لكن الارقام معكوسة، ازاي؟ لو الفشل العضلي في ال RIR كان 0 ف هنا في ال RPE هو 10. لو انت وقفت بعيد عن الفشل العضلي بعدة 1 و ال RIR ف ده معناه ان المجهود بتاعك كان عالي جدا في التمرين ده و ال RPE بتاعك 9. للتبسيط اكثر، هسيبلك جدول تحت مقارنة بين ال RPE و ال RIR # الملخص ## اول حاجة بص على نطاق العدات لكل تمرينة مكتوبالك. على اساس النطاق ده هتختار وزن منطقي تجرب تشيله. ## تاني حاجة هتجيب صاحبك او اي شخص يقف وراك للحماية فقط من اي اصابة انما ميساعدكش في التمرين. ## ثالث حاجة هتلعب لحد ما تجيب اخرك او لحد ما توصل للفشل العضلي و هتقارن العدات. لو الفشل العضلي بتاعك كان في النطاق المكتوب، كدة تمام. لو الفشل العضلي كان اعلي من النطاق المكتوب، كدة الوزن خفيف تقل. لو الفشل العضلي بتاعك كان اقل من النطاق المكتوب، كدة الوزن تقيل خفف. ## رابع حاجة هتلعب بال Scale RIR من (3-0) زي ما شرحتلك فوق. مش لازم توصل للفشل العضلي علشان تزيد عضلات، بالعكس ده هيحط حمل زائد على جهازك العصبي و عضلاتك و هيزود فرص اصابتك. طول ما انت قريب من الفشل العضلي ف كدة انت بتدي جسمك المحفز اللازم لزيادة الكتلة العضلية بنسبة ارهاق اقل، كدة انت الكسبان. لو عايز تقرا البحث عن عدم لزوم الوصول للفشل العضلي اضغط هنا، او هنا. الراحة .4 # اهمية الراحة ومدتها لما بتخلص مجموعتك هتقعد و محتار مفروض تريح قد ايه قبل ما تكمل تاني. هل نص دقيقة؟ ولا ٣؟ ولا قد ايه؟ خليني الاول اقولك مشاكل قلة الراحة. لو ريحت فترة قليلة هتلاقي ان ده ماثر عليك بالسلب في المجموعة اللي بعدها. و ده ليه كذه سبب, لما بتتمرن انت بتمرن عضلاتك و بتستخدم جهاز التنفس و قلبك لضخ الدم و ذهنيا لازم تكون حاضر. علشان تتمرن باحسن كفائة لو انت ريحت لفترة قليلة ممكن توقف تمرينك مش علشان العضلة المستهدفة جابت اخرها, بالعكس ممكن ده يكون بسبب انك لسه بتنهج من المجموعة القبلها و مش قادر تاخد نفسك. او انك ذهنيا مش جاهز تشيل الوزن ده تاني و وقتها هتحس ان الوزن اصعب و مش هتقدر تكمل عداتك. او ان عضلاتك المساعدة. تكون هي المرهقة و وقتها برضه هتحتاج توقف تمرين طيب هل فيه وقت معين مفروض اريح بيه لكل التمارين؟ لا. و ده بسبب ان مش كل التمارين شبه بعض. التمارين المركبة بتبقي اصعب من تمارين العزل و وعالشن كده هتلاقي انك محتاج تريح وقت اكثر بعض تمارين المركبة عن تمارين العزل. من الاخر اريح قد ايه؟ خليني اديلك نطاق تريح فيه. لتمارين العزل تقدر تريح من دقيقة. لدقيقة و نص. انما للتمارين المركبة ممكن تزود اكثر لحد ٣ دقائق. --- # 5. زيادة الحمل التدريبي ال Progressive Overload او زيادة حمل التمرين هتلاقيه حديث الساعة عند كل الناس. تعالي اشرحلك ايه ده و ازاي تطبقه. جسمك بيتعود. بمعني؟ اي ضغط بتحطه علي جسمك ف هو مش شايفه او مدرك ايه ده بس بيحاول يتاقلم عليه علشان لو اتحط فيه تاني يبقي مستعد له. نفس الفكرة في التمرين، لما بتتمرن ده حمل و ضغط انت بتحطه علي جسمك، لو انت لعبت نفس التمرين كل مره بنفس الاوزان و العدات و المجاميع هتلاقي نفسك بتتحسن و توصل لنتيجة لحد مرحلة معينة جسمك هيكون تاقلم علي شدة او صعوبة التمرين و بالنسباله بقي الموضوع عادي مفيش اي سبب او محفز يخليه يزيد عضلات تاني. علشان كده دايما هتلاقيني بقولك هنحتاج نصعب في التمرين كل فترة. الصعوبة دي بيكون ليها كذه شكل. # و دي اشكالها .. ## اول شكل انك تزود",
    "docsource": "training_guide"
  },
  {
    "question": "ازاي اختار الاوزان؟",
    "ground_truth": "ازاي تختار الوزن بتاعك اعتقد ده من اهم الاسئلة اللي انت محتاج اجابتها، خليني اقولك ان فيه اكثر من اسلوب تقدر تستخدمه علشان تختار الوزن بتاعك، هشرحلك كل اسلوب. و في الاخر هقولك افضل اسلوب تقدر تستخدمه # 1 REP MAX (RM) يعتبر الاسلوب ده من الاساليب المتعارف عليها من زمان خصوصا لو عايز تعرف مدي قوتك و قدرتك على رفع الاوزان الثقيلة. بكل بساطة الفكرة اللي وراها هي انك بتحدد تمرين معين و بتختبر قوتك فيه بانك تشوف ايه اثقل وزن تقدر تشيله باداء حركي كامل و صح لعدة واحدة. و على اساس النتيجة دي ممكن كل فترة تعيد التجربة و تشوف هل قوتك بتزيد ولا لا. طبعا لو شيلت وزن اثقل ف. كدة قوتك بتزيد طيب ايه علاقة ده بيك؟ هتلاقي بعض المدربين بيستخدموا الاسلوب ده مع المتدربين، بحيث انه عدد من التمارين و يقولك اختبر ال RM يحددلك 1 بتاعك فيهم، بعدها بتستخدم الوزن الناتج عنه و تضربه في 80 % و ده يبقي الوزن المناسب ليك .لاستخدامه في التمرين ده يعتبر الاسلوب ده من افضل الاساليب لو انت هدفك هو قياس القوة بتاعك و لكن له اسباب كثير تخليني .اقولك انه مش افضل اسلوب تستخدمه في تمرينك **اول سبب**، هو انك بتزود فرص الاصابة عندك .خصوصا لو انت مبتدئ او اول مرة تجرب الاختبار ده **تاني سبب**، هو وضع حمل شديد على جهازك العصبي و عضلاتك من ارهاق و ده طبعا هياثر عليك .في ادائك في التمرين **ثالث سبب**، هو الوقت. مينفعش انك تستخدم الاسلوب ده في كل التمارين و ال موضوع هياخد منك وقت مضاعف في الاول لحد ما تعرف تتقنه و تتعود عليه، علشان كده هو ممكن ميبقاش مناسب ليك او لاي شخص هدفه الاساسي هو زيادة الكتلة --- بكل بساطه هتستخدم جهاز ال CALCULATOR 1 RM هنا بتختار التمرين اللي انت حابب تشوف ال 1RM بتاعك فيه و بتجيب وزن تقدر تلعب بيه 3-6 عدات. بعدها بتاخد الوزن ده و تحطه في ال CALCULATOR هيحسبلك بالتقريب اثقل وزن تقدر تلعب بيه عدة واحده هيكون ايه. لو عايز تحسب ال RM1 بتاعك بطريقه امنه اضغط هنا لو حابب تقرا اكثر عن 1RM اضغط هنا تعمل اى لو عايز تحسيل 1RM بتاعك من غير ما تعرض نفسك للاصابة؟ --- # REPS IN RESERVE (RIR) من افضل الاساليب المستخدمة حاليا هو ال Reps in Reserve. خليني اشرحلك ايه هو و ازاي تعرف تطبقه. الموضوع باختصار هو عبارة عن قربك او وصولك للفشل العضلي. بمعني، لو انت دلوقتي لعبت في تمرينة معينة لحد ما جبت اخرك او بمعني تاني الفشل العضلي (هنقول ١٠عدات)، بكدة هتبقي انت خلصت كل العدات بتاعتك اللي تعرف تلعبها. يعني مفيش اي عدة عندك في التانك كان ممكن تلعبها و ملعبتهاش، و بكدة انت ال RIR بتاعك كام؟ صفر. انت خلصت كل العدات الممكنة و وصلت للفشل العضلي. يبقي كدة RIR 0 معناه الفشل العضلي. طيب لو انت بدل ما تلعب ال ١٠ عدات دول لعبت ٩عدات بس و وقفت؟ كدة انت في عدة كان ممكن تلعبها و توصل للفشل العضلي بس انت ملعبتهاش. شايف العدة ال- انت سبتها دي؟ خليتك بعيد عن الفشل العضلي بعدة و بكدة انت سيبتها عدة في التانك عندك، كدة ال RIR بتاعك كام؟ ١. طيب لو وقفت عند ٨ عدات؟ يبقي انت كدة كنت بعيد عن الفشل العضلي بعدتين يعني ال RIR بتاعك ٢. بكده مفروض تكون فهمت ان كل ما ال RIR رقمه يزيد كل ما انت بتبعد عن الفشل العضلي. --- # ازاي تطبق ال RIR ؟ بكل بساطة هتختار وزن انت شايفه مناسب لنطاق العدات اللي انا كاتبهولك، هتجرب تلعب بيه و تخلي شخص واقف معاك للحماية فقط لو انت احتاجت و تلعب لحد ما تجيب اخرك. لحد ما توصل للفشل العضلي، لو لعبت و وصلت للفشل العضلي في النطاق اللي انا كاتبه يبقي كدة انت مختار وزن صح و هتلعب بيه بعد كدة من غير ما توصل للفشل العضلي (هتسيب من عدة لثلاثة) عندك في التانك. لو وصلت للفشل العضلي بعد النطاق اللي انا كاتبه، يبقي الوزن ده خفيف و هتحتاج تستخدم وزن اثقل. لو وصلت للفشل العضلي قبل النطاق اللي انا كاتبه، يبقي الوزن تقيل بزيادة v خففه درجة و العب بيه. # RATED PERCEIVED EXERTION (RPE) ده اخر اسلوب هكلمك عليه و هو نفس الفكرة بالظبط زي ال RIR و لكن الارقام معكوسة، ازاي؟ لو الفشل العضلي في ال RIR كان 0 ف هنا في ال RPE هو 10. لو انت وقفت بعيد عن الفشل العضلي بعدة 1 و ال RIR ف ده معناه ان المجهود بتاعك كان عالي جدا في التمرين ده و ال RPE بتاعك 9. للتبسيط اكثر، هسيبلك جدول تحت مقارنة بين ال RPE و ال RIR # الملخص ## اول حاجة بص على نطاق العدات لكل تمرينة مكتوبالك. على اساس النطاق ده هتختار وزن منطقي تجرب تشيله. ## تاني حاجة هتجيب صاحبك او اي شخص يقف وراك للحماية فقط من اي اصابة انما ميساعدكش في التمرين. ## ثالث حاجة هتلعب لحد ما تجيب اخرك او لحد ما توصل للفشل العضلي و هتقارن العدات. لو الفشل العضلي بتاعك كان في النطاق المكتوب، كدة تمام. لو الفشل العضلي كان اعلي من النطاق المكتوب، كدة الوزن خفيف تقل. لو الفشل العضلي بتاعك كان اقل من النطاق المكتوب، كدة الوزن تقيل خفف. ## رابع حاجة هتلعب بال Scale RIR من (3-0) زي ما شرحتلك فوق. مش لازم توصل للفشل العضلي علشان تزيد عضلات، بالعكس ده هيحط حمل زائد على جهازك العصبي و عضلاتك و هيزود فرص اصابتك. طول ما انت قريب من الفشل العضلي ف كدة انت بتدي جسمك المحفز اللازم لزيادة الكتلة العضلية بنسبة ارهاق اقل، كدة انت الكسبان. لو عايز تقرا البحث عن عدم لزوم الوصول للفشل العضلي اضغط هنا، او هنا. الراحة .4 # اهمية الراحة ومدتها لما بتخلص مجموعتك هتقعد و محتار مفروض تريح قد ايه قبل ما تكمل تاني. هل نص دقيقة؟ ولا ٣؟ ولا قد ايه؟ خليني الاول اقولك مشاكل قلة الراحة. لو ريحت فترة قليلة هتلاقي ان ده ماثر عليك بالسلب في المجموعة اللي بعدها. و ده ليه كذه سبب, لما بتتمرن انت بتمرن عضلاتك و بتستخدم جهاز التنفس و قلبك لضخ الدم و ذهنيا لازم تكون حاضر. علشان تتمرن باحسن كفائة لو انت ريحت لفترة قليلة ممكن توقف تمرينك مش علشان العضلة المستهدفة جابت اخرها, بالعكس ممكن ده يكون بسبب انك لسه بتنهج من المجموعة القبلها و مش قادر تاخد نفسك. او انك ذهنيا مش جاهز تشيل الوزن ده تاني و وقتها هتحس ان الوزن اصعب و مش هتقدر تكمل عداتك. او ان عضلاتك المساعدة. تكون هي المرهقة و وقتها برضه هتحتاج توقف تمرين طيب هل فيه وقت معين مفروض اريح بيه لكل التمارين؟ لا. و ده بسبب ان مش كل التمارين شبه بعض. التمارين المركبة بتبقي اصعب من تمارين العزل و وعالشن كده هتلاقي انك محتاج تريح وقت اكثر بعض تمارين المركبة عن تمارين العزل. من الاخر اريح قد ايه؟ خليني اديلك نطاق تريح فيه. لتمارين العزل تقدر تريح من دقيقة. لدقيقة و نص. انما للتمارين المركبة ممكن تزود اكثر لحد ٣ دقائق. --- # 5. زيادة الحمل التدريبي ال Progressive Overload او زيادة حمل التمرين هتلاقيه حديث الساعة عند كل الناس. تعالي اشرحلك ايه ده و ازاي تطبقه. جسمك بيتعود. بمعني؟ اي ضغط بتحطه علي جسمك ف هو مش شايفه او مدرك ايه ده بس بيحاول يتاقلم عليه علشان لو اتحط فيه تاني يبقي مستعد له. نفس الفكرة في التمرين، لما بتتمرن ده حمل و ضغط انت بتحطه علي جسمك، لو انت لعبت نفس التمرين كل مره بنفس الاوزان و العدات و المجاميع هتلاقي نفسك بتتحسن و توصل لنتيجة لحد مرحلة معينة جسمك هيكون تاقلم علي شدة او صعوبة التمرين و بالنسباله بقي الموضوع عادي مفيش اي سبب او محفز يخليه يزيد عضلات تاني. علشان كده دايما هتلاقيني بقولك هنحتاج نصعب في التمرين كل فترة. الصعوبة دي بيكون ليها كذه شكل. # و دي اشكالها .. ## اول شكل انك تزود بطريقة مباشرة عدد المجاميع ال- بتلعبها لكل عضلة. بمعني بدل ما تلعب ١٢ مجموعة لل ١٤. كدة انت خليهم خليهم في مجموعتين زيادة عن الجسمك كان متعود عليه, ف يتحط تحت ضغط جديد و يتحفز لزيادة الكتلة العضلية. ## تاني شكل انك تزود اوزانك, لو بتلعب بوزن و بقي سهل عليك في النطاق المكتوبلك, يبقي كدة انت قوتك بتزيد و تقدر تكسر وزن و تزود عنه. ## ثالث شكل انك تزود عداتك, ممكن تثبت الوزن ال-انت شايله لو مش قادر تزود عنه و تزود عدد التكرارات بالوزن ده. حتي لو عدة واحدة, ده كافي انه يحط جسمك تحت ضغط جديد. ## رابع شكل انك تقلل مدة الراحة. لو انت مش عارف تعمل اي حاجة من دول ف بكل سهولة انت تقدر تقلل مدة الراحة الجسمك و عضالتك كانوا متعودين عليها, ده هيخلي العضلة هيبقي بالنسبة لها الحمل اثقل و ضغط جديد. ## اخر شكل تقدر تزود شدة التمرين باساليب متقدمة تدخلها في النظام بتاعك. زي ايه؟ خليني اشرحهملك واحدة واحدة. --- # SUPER SETS ده تكنيك باختصار تقدر تستخدمه لزيادة صعوبة التمرين. عبارة عن ايه؟ عبارة عن انك بتختار تمرينتين و تلعب مجموعة من اول تمرينة و بعدها علطول مجموعة من تاني تمرينه من غير راحة في النص. بعد ما تخلص كدة انت خلصت اول مجموعة من السوبر ست. كمثال: لو مكتوبلك ٣ مجاميع لتمرينتين مختلفين, هتلعب مجموعة من الاولي و بعدها علطول مجموعة من التانية و بعدها تريح كدة انت خلصت اول مجموعة من ال٣ مجاميع المكتوبين. تقدر تلعب تمرينتين مختلفين لنفس العضلة و تقدر تلعب تمرينة لكل عضلة و عكسها زي سوبر ست بايسبس مع ترايسبس. # GIANT SETS مش ال Supersets كانوا تمرنتين ورا بعض؟ ال Giant Sets لثالث تمارين ورا بعض لنفس العضلة. كمثال, هتلعب مجموعة من ثالث تمارين مختلفين لعضلة الظهر ورا بعض من غير راحة. لما تخلصهم كدة انت خلصت مجموعة واحدة من ال Giant Set. # DROP SETS ال Drop Sets من الاساليب المرهقة و علشان كدة مينفعش تخلي تمرينتك كلها بالاسلوب ده. الدروب ست بتكون عبارة عن انك بتلعب مجموعتك عادي و بعد ما تخلص من غير ما تريح بتخفف الوزن ب ٢٥% و تلعب مجموعة كمان. خلصت؟ من غير ما تريح تقوم مخفف الوزن تاني ب ٢٥% و ",
    "docsource": "training_guide"
  },
  {
    "question": "اعمل كارديو قبل ولا بعد التمرين؟",
    "ground_truth":"اعمل الكارديو بتاعي قبل ولا بعد التمرين؟ خليك عارف انك دايما عندك معادين تعمل فيهم الكارديو بتاعك. يا بعد التمرين يا في اي وقت تاني في يومك بعيد عن ميعاد التمرين. ليه؟ من اشهر الغلطات لما تلاقي واحد داخل يتمرن كارديو شديد قبل التمرين. خليني اقولك ان ده هياثر بالسلب عليك علشان جسمك هيستخدم مخازن الجاليكوجن من العضلات كمصدر طاقة, ده هيخليك مفرهد و طاقتك قليلة من قبل ما تبتدي تتمرن اصلا. اكيد ده هيبقي ليه تاثير سلبي عليك علشان ادائك هيتاثر بالسلب و مش هتقدر تشيل الاوزان او تلعب بالشدة الكافية. فبالتالي مش هتعرف تعمل زيادة في حمل التمرين و بالتالي زيادتك للكتلة العضلية هتتاثر. علشان كدة يا اما تخلي الكارديو بتاعك بعد التمرين يا اما تبعده عن وقت التمرين خالص.",
    "docsource": "training_guide"
  },
  {
    "question": "انا بعمل كارديو الصبح قبل الفطار؟كده تمام؟",
    "ground_truth":"هل فيه فرق بين الكارديو علي معدة فاضية و انت واكل؟ المفاجاة هنا برضه لا. ابحاث كتير اثبتت ان الكارديو علي معدة فاضية ايوة ممكن تخليك تحرق دهون زيادة في وقتها, ولكن جسمك ذكي و بالتتابع علي مدار اليوم مقدار حرقه للدهون بيقلله و في الاخر هتلاقي النتيجة واحدة. فاختار المناسب لحياتك",
    "docsource": "training_guide"
  },
  {
    "question": "ايه احسن نوع cardio?",
    "ground_truth": "انواع الكارديو وايه احسنهم؟ عندك ٥ انواع للكارديو، خليني اشرحهملك. ## LOW INTENSITY- 1 ده بيبقى عبارة عن كارديو شدة خفيفة زي استخدام العجلة او التريدميل، ضربات قلبك مش بتكون عالية اوي فتاثيره الجسدي عليك و على عملية الاستشفاء بتكون قليلة و دي ميزته مش هيحط ضغط زائد عليك، و لكن مشكلته انه بيطول ممكن من نصف ساعة لساعة كاملة و ناس كتير ممكن تزهق من ده. ## MEDIUM INTENSITY-٢ ده بيبقي عبارة عن كارديو متوسط الشدة، دقات قلبك بتكون بين ٦٤-٧٦% من اقصي قدرة لدقات قلبك، تقدر تحسب ده عن طريق سنك، بتشيل سنك من ٢٢٠، مثال لنوع الكارديو ده هو المشي السريع لدرجة الجري الخفيف. ## HIGH INTENSITY-٣ او ال HIIT. ده بيكون عبارة عن فترات مختلفة الشدة، مثال عليه بيكون انك تجري باعلي سرعة و مجهود عندك لمدة دقيقة و بعدها بتتمشي دقيقة تاخد نفسك فيها و بعدها تجري باعلي سرعة ليك دقيقة و تتمشي دقيقة بعدها و هكذا، مميزات الكارديو ده انه بيخلص بسرعة ممكن ربع او ثلث ساعة، كارديو فيه تحدي و ناس كثير بتحب ده علشان متزهقش، و لكن مشكلته انه مرهق و الزيادة منه ممكن ياثر بالسلب على عملية الاستشفاء بتاعتك، في نوع الكارديو ده هتلاقي جسمك مجبر انه يستهلك النشويات في الاول لانتاج الطاقة الهائلة اللي انت محتاجها و مع مرور الوقت هيضطر انه يستخدم كمان مخازن الدهون بطريقة عملية اكثر علشان يمدك بالطاقة و تعرف تكمل الكارديو بتاعك، ده بالتتابع هيحسن من قدرة جسمك في عملية حرق الدهون لاستخراج الطاقة. DON'T GIVE UP THE BEGINNING IS THE HARDEST --- # FARTLEK-٤ يعتبر شبيه اوي لل HIIT بس خليني اشرحلك الفرق. ال Fartlek ده نظام بتغير فيه شدة مجهودك زي ال HIIT بالظبط و لكن بطريقة غير محددة. بمعني انك مثلا لو هتلعب ربع ساعة HIIT ، هتلعب باعلي سرعة ليك دقيقة و بعدين تتمشي دقيقة و تعيد تاني. انت عارف كل دقيقة بتعدي هتعمل فيها ايه. ال Fartlek مش اوي، مش بيبقي محددلك مدة معينة الموضوع بيبقي نسبيا مبني علي جاهزيتك انت. ممكن تبتدي الاول بمدة معينة مشي و بعدها مشي سريع لفترة و بعدها تجري باعلي سرعة و بعدها تقلل سرعتك و هكذا. انت المتحكم اكثر في رتم الجري و لكن ده مش معناه انها اسهل، في الاخر الموضوع لازم تتحدي نفسك فيه كل مرة عن اللي قبلها. الاتنين ليهم فايدة في زيادة ال VO2 max و ده عبارة عن كمية الاكسجين الجسم بيحتاجها و يستخدمها و ده بيخلي جسمك عنده قابلية للتمرين باداء افضل مع الوقت. > لازم تتحدي نفسك فيه كل مرة عن اللي قبلها # CIRCUIT TRAINING-0 ده بيكون عبارة عن انك بتلعب عدد من التمارين وره بعض من غير راحة، في الاغلب بيبقي عبارة عن ٨-١٠ تمارين مختلفة يا اما بتلعبهم في نطاق عدات (٨-٢٠ عدة) لكل تمرينة او لمدة زمنية معينة. بعد ما بتخلص كل التمارين وره بعض كدة بتكون خلصت مجموعة، بتريح تاخد نفسك لمدة دقيقة مثلا و ترجع تعيد تاني. DO SOMETHING GREAT الموضوع مفيد جدا لو عايز تتمرن في مدة زمنية قليلة، تزود قدرة التحمل عندك و كفاءة عضلة القلب. --- # ايه الفرق بين التمرين AEROBIC و ؟ ANAEROBIC ال**Aerobic Training** ده باختصار هو التمرين الهوائي, التمارين اللي بيكون فيها تنفسك و نبضات قلبك اعلي من وقت الراحة و بيفضل عالي لحد ما تخلص تمرين زي المشي السريع او ركوب العجل و غيره. ال**Anaerobic Training** هو التمرين اللا-هوائي, التمارين اللي بتكون محتاج فيها طاقة لحظية لمجهود عنيف زي تمارين المقاومة او الجري باعلي سرعة. الاختلاف الاساسي بينهم بيكون في مصادر الطاقة و الهدف بتاعك. ال**Aerobic Training** بيزود معدل اللياقة البدنية و قدرة التحمل عندك و طبعا هيكون مفيد بالنسبالك لو هدفك الاساسي هو نزول الوزن و خسارة الدهون. ال **Anaerobic Training** هيكون مفيد بالنسبالك اكثر لبناء الكتلة و القوة العضلية. مصدر الطاقة في التمارين الهوائية بيكون معتمد علي وجود الاكسجين لعمليات حيوية منها ال Glycolysis و Krebs Cycle لتكسير السكر و غيره من المكونات الغذائية لانتاج الطاقة. ده بيختلف في التمارين اللا-هوائية, جسمك مش بيستخدم فيها الاكسجين علشان بتكون محتاج طاقة لحظية, اول عملية اللي هي ال-Glycolysis بتحصل عادي في العضلات لانتاج الطاقة و لكن حمض اللاكتيك (Lactic Acid) بيتراكم كمان, و هنا بتحس بالحرقان في العضلة اللي بيمنعك تكمل تمرينتك. حاجة اخيرة و هي ان انت في الاول بتكون في ال Aerobic Metabolism او التمثيل الغذائي الهوائي لحد نقطة معينة لو عدتها بتدخل في ال Anaerobic Metabolism او التمثيل الغذائي اللا-هوائي. النقطة دي اسمها \"Anaerobic Threshold\". النقطة دي بتكون مفيدة جدا لقياس قدرة التحمل و اللياقة البدنية خصوصا للعدائين. كل ما كانت لياقتك افضل كل ما النقطة دي هتكون عالية مش بتوصلها بسهولة. تقدر تدخل هنا او هنا لو عايز تعرف تفاصيل اكثر. مين احسن نوع كارديو فيهم؟ مفيش اجابة محددة, كل نوع و له فوائده و كل شخص بيفضل نوع عن التاني. اختار المناسب ليك و ارجعلي هرشحلك الافضل لمستواك و هدفك. و ايوه نقدر ندمج الاتنين سوي. # غلطة مشهورة في الكارديو  في ناس كثير بتفضل تستخدم ال Incline Treadmill و ده ببساطة علشان انت بتقدر تبذل فيه مجهود اعلي فتحرق اكثر في وقت اقل، بس تلاقي الشخص رافع التريدميل و ماسك الشاشة جامد. خليني اقولك انك كدة بتخدم نفسك علشان انت كدة قللت جامد المجهود بتاعك، الشاشة عامل مساعد هتسهلك جامد التمرين و بكدة انت مش هتحرق السعرات اللي انت متخيلها. علشان كدة خليبالك و متمسكش في حاجة علشان تستفاد اكثر من كل دقيقة بتلعبها. لو مش متعود تلعبه ابتدي زود تدريجيا ميل التريدميل لحد ما يبقي الموضوع اسهلك وقتها، تابع معايا برضه علشان اعرف اعدلك في الروتين بطريقة تدريجية صحيحة. --- # 8. الاجهاد البدني مع مرور الوقت و انت في زيادة تدريجية لفترة طويلة, هيجي عليك اوقات تحس باجهاد كبير ممكن ياثر بالسلب علي ادائك في التمرين. خليني اشرحلك اسبابه و ازاي نعالج حاجة كده. هشرحلك ما يسمي بال Model Fitness-Fatigue. # دليل ادائك في التمرين في ٣ عوامل مستوايتهم متغيرة مع الوقت. ## اول عامل هو ال Fitness او لياقتك البدنية. طبيعي كل ما المدة الزمنية بتزيد هتلاقي لياقتك البدنية بتزيد، و ده لعدة عوامل منها ال Neurological Adaptation او التكيف العصبي، كمان طبيعي قوتك بتزيد مع زيادة الحجم العضلي بتاعك. ولكن لياقتك البدنية بتتاثر ب عامل تاني و هو الارهاق. ## تاني عامل ال Fatigue او الارهاق. كل ما المدة الزمنية بتزيد هتلاقي في شكلين للارهاق بيزيدوا عندك. اول شكل، و هو الارهاق الذهني. و ده بيجي بانك دايما بتكون حاسس ان ملكش مزاج تتمرن و مش قادر تروح التمرين. تاني شكل، و هو الارهاق العضلي، و ده بسبب تلف او تكسير الالياف العضلية و زيادة معدلات المستقلبات في العضلات زي حمض اللاكتيك. ## ثالث عامل بيكون نتيجة اول عاملين و هو ال Performance او ادائك الرياضي. كل ما معدل الارهاق عندك زاد كل ما هتلاقي لياقتك البدنية بتقل و ادائك الرياضي بيقل و فرص اصابتك كمان بتزيد. و العكس صحيح. طيب استفاد ايه من كل ده؟ لازم يبقي لينا طريقة نحل بيها الموضوع ده بحيث دايما نحاول نخلي معدل الارهاق عندك في مستوي معين ميزيدش عنده و تفضل في تطور مستمر باقل فرص اصابات، هنا هنيجي لل Deload. --- # DELOAD وقت ما تلاقي علامات الارهاق عندك و ادائك في التمرين متاثر بالسلب، ممكن تاخد اسبوع Deload. ## ايه هو ال Deload ؟ هو بيكون اسبوع تمرين خفيف بتريح فيه جسمك و مفاصلك و الجهاز العصبي بتاعك مع المحافظة علي قوتك. ## ازاي اطبقه؟ عندك كذه طريقة ممكن تعمل فيها Deload. **اول اسلوب،** هو انك تقلل مجاميعك للنص و تلعب بنفس اوزانك و عداتك. يعني لو بتلعب ٤ مجاميع للتمرينة هتلعب اتنين بس مع نفس اوزانك و عداتك. **تاني اسلوب،** هو انك تقلل مجاميعك و اوزانك للنص و تقلل عداتك كمان لحد ما تلعب ٥ RIR. **ثالث اسلوب،** تاخد اسبوع كامل اجازة من التمرين. --- # تستخدم انهي اسلوب؟ على حسب مستوى الارهاق عندك و تاثيره السلبي عليك هحددلك انهي اسلوب نقدر نستخدمه. بكدة هنكون اخدنا اسبوع خفيف تريح فيه علشان لما ترجع الاسبوع هتلاقي معدل الارهاق عندك قل جامد و تقدر انك تكمل زيادة حمل التمرين بتاعك. ال Deload ملوش وقت محدد, يعني مش بعد 3 اسابيع او 6 و هكذا, الموضوع بيختلف من شخص للتاني على حسب قدرة كل جسم على تحمل الارهاق و رد فعله للتمرين. الراحه/االستشفاء .8 # RECOVERY ## ايام الراحة و الاستشفاء العضلي لو وصلت لهنا فاعتقد انك اصبحت مدرك باهمية الراحة للاستشفاء العضلي والجسدي. انك تتمرن كل يوم من غير راحة ولا يوم مش هيديلك اي فائدة زيادة، و لكن بالعكس هتاثر علي عملية الاستشفاء بتاعتك و ده هيخلي معدل الارهاق عندك يزيد اسرع و يعطلك كتير عن التمرين من حيث ادائك و التطور المطلوب في حمل التمرين. يفضل علي الاقل يبقي عندك يوم واحد اجازة في الاسبوع عن التمرين للاستشفاء، خصوصا ان بعد التمرين جسمك بيحتاج كمية اكسجين اعلي علشان يرجع للمعدل الطبيعي لاليض او ال Metabolism ، و علشان اساعدك تزود من الاستشفاء بتاعك خليني اقولك اربع حاجات ممكن تعملهم. --- اول حاجة، اتاكد انك بتاكل كمية البروتين بتاعتك في الدايت، البروتين بيساعد في الاستشفاء العضلي عن طريق زيادة عملية خلق البروتين و ده هيساعد في اعادة تكوين الالياف العضلية. تاني حاجة، اتاكد انك بتنام كويس من 6-8 ساعات يوميا، قلة النوم بتاثر علي عملية الاستشفاء عندك و بتزود من فرص الاصابة. اضغط هنا علشان تشوف تاثير قلة النوم عليك. ثالث حاجة، لو تقدر تعمل جلسة مساج مرة شهريا، ابحاث كتير وضحت ان المسا",
    "docsource": "training_guide"
  },
  {
    "question": "اريح اد ايه في الاسبوع",
    "ground_truth":" RECOVERY ## ايام الراحة و الاستشفاء العضلي لو وصلت لهنا فاعتقد انك اصبحت مدرك باهمية الراحة للاستشفاء العضلي والجسدي. انك تتمرن كل يوم من غير راحة ولا يوم مش هيديلك اي فائدة زيادة، و لكن بالعكس هتاثر علي عملية الاستشفاء بتاعتك و ده هيخلي معدل الارهاق عندك يزيد اسرع و يعطلك كتير عن التمرين من حيث ادائك و التطور المطلوب في حمل التمرين. يفضل علي الاقل يبقي عندك يوم واحد اجازة في الاسبوع عن التمرين للاستشفاء، خصوصا ان بعد التمرين جسمك بيحتاج كمية اكسجين اعلي علشان يرجع للمعدل الطبيعي لاليض او ال Metabolism ، و علشان اساعدك تزود من الاستشفاء",
    "docsource": "training_guide"
  },
  {
    "question": "انا بريح يومين في الاسبوع و بردو حاسس بتعب",
    "ground_truth":"خليني اقولك اربع حاجات ممكن تعملهم. --- اول حاجة، اتاكد انك بتاكل كمية البروتين بتاعتك في الدايت، البروتين بيساعد في الاستشفاء العضلي عن طريق زيادة عملية خلق البروتين و ده هيساعد في اعادة تكوين الالياف العضلية. تاني حاجة، اتاكد انك بتنام كويس من 6-8 ساعات يوميا، قلة النوم بتاثر علي عملية الاستشفاء عندك و بتزود من فرص الاصابة. اضغط هنا علشان تشوف تاثير قلة النوم عليك. ثالث حاجة، لو تقدر تعمل جلسة مساج مرة شهريا، ابحاث كتير وضحت ان المساج بيقلل وجع العضلات. رابع حاجة، ممكن تجرب ال Ice Bath او حمام التلج علي اساس انه برضه بيقلل من وجع العضلات و الالتهابا",
    "docsource": "training_guide"
  },
  {
    "question": "اكل قد ايه بروتين في اليوم؟",
    "ground_truth":"ازاي تحسب احتياجك اليومي من البروتين؟ بتحسب احتياجك بناء على اجمالي وزن جسمك، الابحاث العلمية اثبتت انك هتحتاج من <ins>1.6- 2.5 جرام لكل كيلو</ins>، ابحاث تانية اثبتت انك هتحتاج <ins>1.8- 2.7 جرام لكل كيلو</ins> مع عجز السعرات الحرارية علشان تنزل في الدهون و تحافظ على الكتلة العضلية. كمثال: لو انت وزنك 70 كيلو يبقي احتياجك اليومي من البروتين يتراوح ما بين 112 جرام كحد اقل و 189 جرام كحد اقصى.",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "اكل ايه ممكن يعلى الtestosterone?",
    "ground_truth": "Testosterone\"، <ins>كذه بحث</ins> اكد ان نقص نسبة الدهون في نظامك الغذائي ممكن ياثر بالسلب علي معدل الهورمونات في جسمك، و ده بينتهي بتاثير سلبي علي عملية زيادة الكتلة العضلية و خسارة الوزن. الاحماض الدهنية (اوميجا 3 و 6) ليهم منافع كثير منها تقليل ضغط الدم، زيادة الكوليسترول النافع، الحماية من انسداد الشرايين، تقليل الالتهابات و غيره. علشان كده نقصهم في الدايت هياثر علي عمليات كثير منهم عملية الاستشفاء بتاعتك. ## افضل مصادر للدهون عرفت اهمية الدهون في نظامك الغذائي؟ خليني اقولك ان في انواع للدهون ومش كلهم زي بعض. عندك الدهون المشبعة (Saturated Fats) و الدهون المتحولة (Trans Fats) يفضل تقللهم في اكلك و نظامك الغذائي. و ده بسبب انهم ممكن يزودوا الكوليسترول الضار (LDL) و امراض القلب (CHD). العكس صحيح ينصح انك تزود من الدهون الغير مشبعة او ال(Unsaturated Fats) للصحة العامة. من افضل مصادر الدهون الصحية اللي تستخدمها في نظامك الغذائي هيكون المكرات، زبدة الفول السوداني، زيت الزيتون، زيت عباد الشمس، صفار البيض، الافوكادو و الاسماك الغنية بالدهون زي السلمون و الساردين. ## طريقة حساب احتياجك من الدهون بناء علي اخر الابحاث العلمية، فافضل طريقة لحسابة احتياجك من الدهون هيكون نسبة من اجمالي سعراتك اليومية. النسبة بتراوح من 15-30% من سعراتك اليومية. يعني لو بتاكل كمثال 2000 سعره يوميا، عندك من 300-600 سعره هيكون مخصص للدهون الصحية، لو قسمت علي 9 هيطلعلك الجرامات بالظبط في المثال ده (33-66 جرام يوميا). # النشويات النشويات هي اخر مكون بيتحسب بعد البروتين و الدهون. طريقة حسبته سهلة جدا و هو «باقي سعراتك». بمعني انت بتشوف فضلك سعرات حرارية قد ايه بعد ما تخصم احتياجك من البروتين و الدهون و الباقي ده هتكون سعراتك من النشويات. ## طريقة حساب احتياجك من النشويات النشويات هي اخر مكون بيتحسب بعد البروتين و الدهون. طريقة حسبته سهلة جدا و هو «باقي سعراتك». بمعني انت بتشوف فضلك سعرات حرارية قد ايه بعد ما تخصم احتياجك من البروتين و الدهون و الباقي ده هتكون سعراتك من النشويات. ## «تطبيق عملي» احمد عنده ٢٥ سنه، طوله ١٧٣، وزنه ٧٠ كيلو، نسبة دهونه ١٥٪، بيتمرن ٤ ايام في الاسبوع و عايز يحسب احتياجه علشان يخسر دهون. تعالي اقولك هيحسبها ازاي.. ## اول خطوة: السعرات الحرارية. احمد هيدخل على ال <ins>Online Calculator</ins> و يكتب بياناته. لما يدوس على Calculate هيطلعله اجمالي سعرات ثباته. طلعله حوالي ٢٥٠٠ سعره. لو اكل السعرات دي هيحافظ على شكل جسمه، لكن علشان هو عايز ينزل في نسبة الدهون فلازم يكون في عجز سعرات حرارية. هنا هنصحه يبتدي بعجز ٣٠٠ سعره كبداية. بكده احمد هياكل ٢٢٠٠ سعره يوميا. ## تاني خطوة: البروتين، احمد عنده من 1.6- 2.5 جرام لكل كيلو. علشان يكون في الامان اختار 2 جرام لكل كيلو، بكدة احمد هياكل 140 جرام بروتين يوميا. (جرام البروتين فيه 4 سعرات حرارية، كده احمد هيدخل 560 سعره يوميا من البروتين). ## ثالث خطوة: الدهون، احمد عنده من 15-30% من سعراته يقدر يدخلها من الدهون، لكن هو مش بيحب مصادر الدهون بشكل كبير فاختار 20% للدهون. 20% من 2200 سعره تساوي 440 سعره للدهون و علشان كل جرام دهون فيه 9 سعرات حرارية، احمد قسم 440 سعره علي 9 طلعله 49 جرام من الدهون يوميا. ## رابع خطوة: النشويات، زي ما قولنا النشويات هي متبقي السعرات الحرارية، فاحمد جمع سعراته اللي استهلكها من البروتين و الدهون (560 سعره + 440 سعره) و خصمهم من اجمالي سعراته (2200 سعره) طلعله 1200 سعره للنشويات، و علشان كل جرام نشويات فيه 4 سعرات حرارية، كده احمد هيدخل 300 جرام يوميا من النشويات. ## الكارب المعقد و البسيط تعالي نبتدي بالكارب البسيط او ال Simple Carb و ده بكل بساطة النشويات صغيرة الحجم، مفيهاش روابط كتير، بتكون في ابسط صورة، بتسمي بال Monosaccharides او Disaccharides علي حسب عدد جزيئات السكر و مفيهاش الياف كتير. علشان هي في ابسط صورة و سهلة التكسير بتلاقي ان امتصاصها عالي اوي فبتديلك طاقة لحظية في وقتها و بتعلي مستوي الانسولين في جسمك عالطول فبتتصنف انها \"High Glycemic Index\" و زي ما هي بتديلك طاقة لحظية سريعة، الطاقة مش بتستمر لفترة طويلة و ممكن بعدها تلاقي نفسك هبط شوية او طاقتط بقت قليلة. الكارب البسيط احساس الشبع فيه برضه مش بيكون عالي بسبب قلة الالياف و المياه في معظم انواعه و ممكن كثرته يزودلك ال Sugar Cravings. مثال للكارب البسيط او ال Simple Carb هيكون كل انواع الحلويات، السكر الابيض، السكر اللي في اللبن و سكر الفركتوز اللي في الفاكهة (حتي و لو في فواكه بتصنف علي انها معقده). العكس في الكارب المعقد، بتلاقي انه مكون باكثر من 3 جزيئات، فيه روابط اكثر و يسمي بال Polysaccharides. بسبب ان حجمه اكبر و معدل الالياف فيه اعلي بتلاقي انه بياخد وقت اطول للتكسير و الهضم فبيكون بطيء الامتصاص. ده بينتهي ب انه بيديلك طاقة ممتدة لفترة اطول، مش بيعلي الانسولين جامد في جسمك مرة واحدة (Lower Glycemic Index) و بيساعدك علي الاحساس بالشبع اكثر. مثال للكارب المعقد او ال Complex Carb هيكون البطاطس، البطاطا، الرز، الخضار و البقوليات. وجود الالياف في مصادر الاكل دي هيساعدك توصل للتوصية اليومية لكمية الالياف في نظامك الغذائي و هي 25-75 جرام يوميا. الالياف بتحسن تنظيم حركة الامعاء و ده هيساعد الجسم في تحسين امتصاص الاكل و صحة جهازك الهضمي. لكن لو دخلت كمية اكثر من كده الموضوع ممكن يقلب بالعكس و يجيلك انتفاخات في البطن و مشاكل صحية. معرفة المعلومات دي هتساعدك توظف كل مصدر نشويات في الوقت الصح لو هدفك تحسين الصحة العامة, طاقتك اليومية و ادائك في التمرين, احساسك بالشبع و تقلل شراهة الاكل و النزول في وزن بشكل عام. ## ايه هو ال Glycemic Index ؟ ال **Glycemic Index** او المعدل الجلايسيمي هو مقياس لقدرة كل نوع اكل في زيادة مستوى السكر في الدم من 1-100 و ده كان المقياس التاريخي اللي بيخلي الدكاترة و الناس في العموم تقسم النشويات للحلو و الوحش. طبعا كل ما زاد الرقم كل ما كان سرعة زيادة السكر في الدم اعلى كل ما هرمون الانسولين اتفرز اكثر. وقتها تم تقسيم المعدل الجلايسيمي ل 3 اقسام. لو رقم المعدل الجلايسيمي لنوع الاكل اقل من 55 فده كده كويس جدا و مش بيعلي سكر الدم جامد, لو من 55-69 ده متوسط و لو اكثر من 70 ده كده عالي و حاول تقلل منه. بكل بساطة النشويات اللي بتعلي مستوي السكر في الدم جامد هتزود من افراز هورمون الانسولين في الدم، النتيجة هتكون طاقة عالية و لكن لحظية علشان مستوي السكر في الدم بيقل بعد فترة قليلة. العكس مع النشويات اللي بتعلي مستوي السكر في الدم ببطيء، ده هيساعدك انك تحتفظ بطاقة منتظمة لفترة اطول و ده اللي هيوديبل للسؤال اللي بعده، ازاي احسن طاقي و احساس الشبع. ## ازاي تزود الطاقة و احساس الشبع؟ ناس كتير بروح تتمرن و بيكون عندها طاقة عالية اوي في بداية التمرين و بعدها في نص التمرين بيهبطوا و ميقدروش يكملوا، ده بسبب الاختيار الغلط لمصادر النشويات قبل التمرين. الناس دايما بتلجا لسكريات اكثر و عصاير، مصادر ممكن تديهم طاقة لحظية و لكن مش لفترة طويلة. مع انهم لو اختاروا مصادر نشويات فيها الياف اكثر زي البطاطس و الشوفان هيبقي فعلا فيه اختلاف شاسع. ده بسبب ان المصادر دي بتاخد وقت اطول في الهضم، الامتصاص و بتحافظ على مستوى الانسولين في الدم لفترة اطول. علشان كده دايما هتلاقي كل الابحاث بتنصح انك تاكل مصادر نشويات معقدة قبل التمرين و تخلي مصادر النشويات البسيطة بعد التمرين او بعيد عن التمرين. احساس الشبع كمان بيتاثر بالمعدل الجلايسيمي لنوع الاكل بتاعك. في دراسة اتعملت على ٣ مجموعات، كل مجموعة اكلت وجبة بنفس السعرات الحرارية بس بمعدل جلايسيمي مختلف (واطي، متوسط و عالي). طبعا كانت النتيجة ان المجموعة اللي اكلت اعلى معدل جلايسيمي كان عندها اعلي معدلات الجوع، كمان كان فيه زيادة في مستوي الادرينالين في جسمهم و الباحث وقتها استنتج ان ده اشارة من الجسم بسبب زيادة احساس الجوع. و بعدها الباحث ساب الباب مفتوح لل٣ مجاميع انهم ياكلوا تاني و للمجموعة اللي كانت واكله اعلي معدل جلايسيمي انتهي بيهم الحال انهم واكلين ٦٥٠ سعره زيادة في الوجبة دي. # اهم الفيتامينات والمعادن المغذيات الدقيقة المعروفة باسم الفيتامينات و المعادن هي المكونات الاساسية لاي نظام غذائي عالي الجودة و ليها تاثير قوي على الصحة العامة حتى لو احتياج جسمك منها هيكون بكميات قليلة. هوضحلك دلوقتي اهم المغذيات الصغيرة اللي جسمك هيكون محتاجها. ## البوتاسيوم K الجسم بيحتاج في المتوسط من ٣٦٠٠-٤٢٠٠ ملجرام/يوم. اهم مصادره هي البطاطا, الموز البطاطس و الافوكادو. البوتاسيوم هيساعدك على منع التشنجات العضلية و استرخاء العضلات. كمان هيساعدك في المحافظة على صحة العظام, زيادة كثافتها و المحافظة على توازن الاحماض الضرورية لحفظ الكالسيوم داخل الجسم. ## المغنسيوم Mg الجسم بيحتاج في المتوسط ٤٠٠ ملجرام/يوم. مصادره هي العدس, الفول, السبانخ, الشوفان و الموز. هيساعدك على امتصاص الكالسيوم و زيادة كثافة العظام. ## الزنك Zn الجسم يحتاج في المتوسط ١٥-٥٠ مللجرام/يوم. مصادره هي اللحوم الحمراء، السلمون و الفاصوليا. الزنك هيساعدك في زيادة سرعة الاستشفاء، تحفيز جهاز المناعة و زيادة انتاج الحيوانات المنوية و مستوي هورمون التيستوستيرون في الجسم. ## الكالسيوم Ca الجسم يحتاج في المتوسط ١٠٠٠ مللجرام/يوم. مصادره هي منتجات الالبان، البيض و البروكلي. طبعا هو اهم عنصر لنمو و تقوية العظام و الاسنان. ## الاوميغا ٣ Ω3 هو حمض دهني ",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "ازاي احس اني شبعان دايما",
    "ground_truth":"ازاي تزود الطاقة و احساس الشبع؟ ناس كتير بروح تتمرن و بيكون عندها طاقة عالية اوي في بداية التمرين و بعدها في نص التمرين بيهبطوا و ميقدروش يكملوا، ده بسبب الاختيار الغلط لمصادر النشويات قبل التمرين. الناس دايما بتلجا لسكريات اكثر و عصاير، مصادر ممكن تديهم طاقة لحظية و لكن مش لفترة طويلة. مع انهم لو اختاروا مصادر نشويات فيها الياف اكثر زي البطاطس و الشوفان هيبقي فعلا فيه اختلاف شاسع. ده بسبب ان المصادر دي بتاخد وقت اطول في الهضم، الامتصاص و بتحافظ على مستوى الانسولين في الدم لفترة اطول. علشان كده دايما هتلاقي كل الابحاث بتنصح انك تاكل مصادر نشويات معقدة قبل التمرين و تخلي مصادر النشويات البسيطة بعد التمرين او بعيد عن التمرين. احساس الشبع كمان بيتاثر بالمعدل الجلايسيمي لنوع الاكل بتاعك. في دراسة اتعملت على ٣ مجموعات، كل مجموعة اكلت وجبة بنفس السعرات الحرارية بس بمعدل جلايسيمي مختلف (واطي، متوسط و عالي). طبعا كانت النتيجة ان المجموعة اللي اكلت اعلى معدل جلايسيمي كان عندها اعلي معدلات الجوع، كمان كان فيه زيادة في مستوي الادرينالين في جسمهم و الباحث وقتها استنتج ان ده اشارة من الجسم بسبب زيادة احساس الجوع. و بعدها الباحث ساب الباب مفتوح لل٣ مجاميع انهم ياكلوا تاني و للمجموعة اللي كانت واكله اعلي معدل جلايسيمي انتهي بيهم الحال انهم واكلين ٦٥٠ سعره زيادة في الوجبة دي.",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "انا دائما نومي بايظ",
    "ground_truth": "النوم و تاثيره علي رحلتك لهدفك بالرغم من ان معظم الناس مش بتدي الموضوع حقه و لكن فعلا النوم بيفرق! النوم و الراحة ليهم تاثير علي تقريبا كل حاجة في الجسم من مستوي هورموناتك، لكفائة الاجهزة الداخلية. في دراسة اتعملت علي مجموعتين من الناس، مجموعة كانت بتنام قليل ٥ ساعات و نصف، المجموعة التانية كانت بتنام ٨ ساعات ونصف. المجموعتين كانوا علي دايت بعجز سعرات حرارية و البحث انتهي ب ان المجموعتين خسروا نفس الوزن. طب فين المشكلة؟ المجموعة اللي كانت بتنام اقل خسرت معظم الوزن من الكتلة العضلية مش الدهون.. الدراسة اثبتت ان كمان قلة النوم كان ليها تاثير مباشر علي زيادة هرمون الجوع \"Ghrelin\" في الجسم و ده السبب وراء ان ملا الشخص بينام اقل بيكون عنده شراهة في الاكل و طبيعي ده ممكن ياثر عليك انك تحتفظ علي سعراتك الحرارية و الوصول لهدفك. طيب ليه المجموعة اللي نامت اقل خسرت كتلة عضلية كبيرة؟ ده كان بسبب زيادة مستوي كل الهرمونات الهدامة \"Catabolic\" زي ال Cortisol و نقص مستوي كل الهرمونات البنائة \"Anabolic\" زي هرمون ال Myostatin ، ال IGF-1، Testosterone. بالتالي كانت عملية تكسير البروتين اعلي من خلق البروتين و ده ادي لخسارة الكتلة العضلية. (Muscle Breakdown>Muscle Protein Synthesis). # ازاي تقيم التطور بتاعك عندك 4 طرق اساسية تقيم بيهم التطور بتاعك. اول طريقة, هي الميزان. اكيد لما بتوزن نفسك و تلاقي فيه تغير في الميزان في الاتجاه المناسب لهدفك فده تطور لكن خليني اقولك غلطة شائعة الناس بتعملها و هي انهم بيقيسوا وزنهم مرة واحدة بس في الاسبوع و علي اساسه بيقيموا التطور بتاعهم و يا اما يكونوا مبسوطين او يكونوا زعلانين و يبنوا تصرفاتهم علي اساس الرقم ده. تعرف ان وزنك هتلاقيه بيتغير كل يوم؟ طبيعي تلاقي فيه اختلافات في وزنك كل شوية و ده بسبب عوامل كتير منهم النوم, قلة شرب المياه, الضغط النفسي, زيادة الملح في الاكل, زيادة حبس المياه, وقت الدورة الشهرية للبنات و خلافه اسباب كتير. فطبيعي ممكن تلاقي نفسك محظوظ و وزنت نفسك في يوم كان وزنك نازل فيه زيادة او توزن في يوم جسمك يكون مضغوط فيه و تلاقي وزنك عالي. فافضل حاجة تعملها هي انك توزن نفسك كل يوم علي معده فاضية الصبح بعد ما تدخل الحمام و تاخد المتوسط الاسبوعي لوزنك (اجمالي وزنك علي مدار الاسبوع / 7) علشان تقلل من نسبة الخطا و يبقي عندك فعلا رقم تقدر تبني عليه خطواتك اللي بعدها. يفضل انك تنزل في حدود 1% من وزن جسمك في الاسبوع، اقل من كدة الموضوع هيطول منك جامد و اعلي من كدة ممكن تكون معرض لخسارة عضلية اكثر، لكن لو شخص نسبة دهونه عالية اوي ممكن ينزل برتم اعلي من كدة. **ثاني طريقة**، هي مقاساتك. بعض الناس مش بتفضل تشوف وزنها كام كل يوم و وقتها هيكون البديل هو القياسات و ده عن طريق انك تقيس بالمتر محيط الصدر، الذراع، الخصر و الرجل مرة كل اسبوع و تقييم التطور بتاعك علي حسب الارقام دي. **ثالث طريقة**، جهاز ال Inbody. مع انه مش ادق حاجة في العالم و لكن ممكن يفيدك كمؤشر ثالث مع الطرق الاخري. اكيد لو بتستخدم اكثر من طريقة لتقييم التطور بتاعك هيكون افضل من استخدام طريقة واحدة. نصيحتي ليك وقتها هي انك حاول تثبت المكان لان كل مكان بيعمل Calibration مختلفة للجهاز، اشرب مياه كويس قبلها بيومين، اعمله علي معدة فاضية و متعملوش بعد يوم تكون انت مبوظ اكلك فيه. **رابع طريقة**، صورك و شكلك في المراية. طبعا دي افضل و ادق طريقة لتقييم التطور بتاعك. الصور مش هتكدب، لو فيه تطور اكيد هيبان من اسبوع للتاني. فدايما حاول تتصور في نفس المكان بنفس الاضاءة علي معدة فاضية بحيث تعرف تقيم الفرق بصورة سليمة. دي طرق اساسية للتقييم. بس خليك عارف ان شكل من غير صحة هو ولا حاجة. لازم تعرف برضه صحتك بتتحسن ولا لا و ده عن طريق متابعة معدلات الطاقة في يومك, الضغط النفسي من الدايت, الاحساس بالجوع و الشبع, جهازك الهضمي و هل فيه انتفاخات او لا, النوم كفائته بتتحسن ولا فيه تاثر سلبي و خلافه.. ## خرافات متعلقة بالتغذية ### الاكل بليل بيتخن؟ هرد عليك بسؤال, هو جسمك عارف دلوقتي الساعة كام؟ اكيد لا, جسمك مش هييجي بعد ساعة معينة يوقف حرق و يقرر يخزن الاكل. بالعكس انت جسمك بيحرق 24 ساعة حي و انت نايم. انت اجهزة الجسم كلها شغالة و في نفس الوقت اكثر وقت بيحصل فيه عملية الاستشفاء. ف كل عادي في اي وقت متقلقش لو اكلت بليل, لكن يفضل متاكلش قبل النوم مباشرة (مش علشان هتتخن) علشان متتعبش و انت نايم و يجيلك اعراض عسر الهضم زي الحموضة و خلافه. ### هل مفروض اقطع ملح؟ الاجابة السهلة البسيطة, لا. لو انت حد قالك اقطع ملح اعرف ان معلوماته مينفعش تعتمد عليها. الملح مهم جدا علشان من غيره الشخص هيدخل في حالة اسمها \"Hyponatremia\". ده بكل بساطة هيادي للخمول, ارهاق عام, تاثير سلبي علي ضغط الدم, زيادة الشد العضلي و فرص الاصابة, هبوط في الدورة الدموية لو الشخص يتمرن بشدة عالية و ممكن ينتهي الحال بمشاكل في القلب. هقولك حبس المياه بيعتمد علي ٣ عوامل: النشويات, المياه و الملح. لو انت بتدخل كل يوم كمية ملح مختلفة فطبيعي جسمك هيحبس مياه اكثر انما لو بتدخل كمية معتدلة كل يوم هتلاقي حبس المياه بيقل مع الوقت. ## هل محتاج اعمل Detox ؟ لا دي بتبقي انظمة غذائية للدعاية فقط و جذب الانتباه. انك تعمل اسبوع ديتوكس و تشرب عصاير بس, انت هتخس جامد و اه هتكون ربحت جسمك شوية لكن بصورة ملهاش لزمة و اول مترجع تاني للاكل الطبيعي وزنك هيزيد تاني و هتبقي النتائج مش ثابتة, علشان كده اي حد بيفضل يخس و يزيد بال\"Yoyo-Dieting\", ده بعيدا عن ان جسمك فيه الكبد و الكلي علطول بيتخلصوا من السموم و اي شيء ممكن يضر جسمك. ده طبعا السبب الاول و الاساسي ليه انت مش محتاج ديتوكس. ## هل ممكن تخس من جزء معين في جسمك؟ لا مش ممكن. هنا بنتكلم علي مصطلح \"Spot Fat Reduction\", الجسم ذكي و مش بيخس من منطقة محددة. اماكن تخزين الدهون في الجسم بتكون مبنية علي الجينات. وقت التنشيف الشخص بيزل دهون من كل جسمه و علشان كده مع مرور الوقت الشخص بيلاق وشه خس. علميا مفيش نظام دايت او تمرين يخلي الشخص يخس من منطقة معينة, لكن هو بيخس من جسمه كله و مع مرور الوقت شكله كله بيتغير لحد ما يوصل لهدفه. بالنسبة للبنات، مفيش تمارين اسمها نحت الجسم او Toning ، انما لشد الجسم يفضل المبني علي نظام غذائي بعجز سعرات حرارية لخسارة الدهون مع التمرين بشدة متطورة لبناء الكتلة العضلية للوصول لهدف شد الجسم. ## هل لازم اخد مكملات؟ لا، المكملات هي وسيلة تساعدك انك تكمل و توصل لاحتياجات جسمك اليومية لو انت مش قادر توفرها من الاكل. انما لو بتدخل احتياجاتك كلها وقتها اهمية المكملات بتقل. ## هل ممكن اخد حارق دهون و معملش دايت؟ حوارق الدهون مش حل سحري لخسارة الوزن، اول و اهم شيء هو الالتزام علي نظام غذائي بعجز سعرات حرارية. وقتها حارق الدهون ممكن يساعدك في اخر فترة التنشيف كورقة اخيرة تستخدمها علشان هو مش هيحسن نتايجك بغير ١٠% كحد اقصي، كمان لازم تكون عارف ان مشاكله كتير زي زيادة نبضات القلب، زيادة ضغط الدم و زيادة الارق. ## هل لازم اوزن اكلي؟ ايوه، من اهم ادوات الدايت هي ميزان الاكل و ده لدقة الكميات المستخدمة. لو مش ماشي علي ميزان اكل في الغالب نظامك الغذائي هيفشل بسبب استخدام مقادير غير محددة مما يقلل في دقة حساب السعرات. ## اوزن اكلي قبل ولا بعد الطبخ؟ يفضل توزن اي مصدر نشويات قبل الطبخ علشان الكمية بعد الطبخ بتختلف على اساس كمية المياه المستخدمة. يفضل توزن اي مصدر بروتين بعد الطبخ علشان مصادر البروتين بتخسر نسبة من وزنها في صورة مياه. ## ازاي احسب سعرات الاكل اللي باكله علي الموبايل؟ تقدر تستخدم كذه تطبيق زي MyFitnessPal او Fat Secret. لكن علشان فيه ناس كتير مش بتعرف ازاي تستخدمهم فتقدر تشوف الفيديو ده و الفيديو ده للتطبيق العملي. # تعمل ايه وقت ال Cravings ؟ طبيعي في اوقات تلاقي ان نفسك تاكل حاجة مختلفة او اكل برة الدايت، لازم تكون عارف ازاي تتعامل مع المواقف دي علشان متبوظش الدايت بتاعك و في نفس الوقت متحرمش نفسك، فخليني اقولك شوية نصائح تتعامل بيها في المواقف دي. 1. خليك عارف ان البيئة اللي حواليك ليها تاثير قوي عليك. بمعني ان لو انت كل الحلويات قدامك في المطبخ طول الوقت، طبيعي يكون نفسك تدوق منهم شوية و لو حسيت انك محروم منهم ممكن تبوظ خالص و تفشل في انك تكمل الدايت. 2. خدت بالك من كلمة حرمان اللي كتبتهالك في اول نقطة؟ مينفعش تخلي الدايت بتاعك من اكل انت مش بتحبه او التنويع فيه قليل جدا، حاول تخلي الدايت فيه تنويع و تقدر تدخل فيه اكل انت بتحبه. ممكن تمشي علي نظام غذائي مرن بحيث تقدر تستخدم ٢٠٪ من سعراتك اليومية في سناك انت بتحبها لكن بشرط انك تكون ظابط سعراتك و بتدخل احتياجك اليومي من البروتين. 3. اتاكد انك بتشرب مياه بصورة كويسة، العطش في اوقات بيتم ترجمته من جسمك ليك اكنه جوع و تحس بشراهة في الاكل. 4. قلة النوم بياثر علي مستوي هورمونات الجوع و الشبع عندك (Leptin & Ghrelin) و اكيد ده هياثر عليك، فحاول تنام عدد ساعات كافي. 5. حاول تكون مخطط يومك من الاول و عارف ايه هي وجباتك اللي مفروض تاكلها. العشوائية و انك تسيب نفسك للحظتها اكيد هتزود من فرص تبويط الدايت و التراهة في الاكل. 6. ممكن تاكل فاكهة قليلة في السعرات زي الفراولة، البطيخ، الكنتالوب والاناناس بعدها تستني نصف ساعة قبل ما تفكر تطلب اكل او تاكل لحظية. هتلاقي التراهة للحلويات اللي جسمك اتعود عليها اقل و مش هتحتاج تبوظ الدايت. 7. ممكن لو خلاص طلبت اكل تشرب مياه او تاكل طبق سلطة قبله بحيث يملي بطنك شوية و تلاقي نفسك مش بتاكل كميات كب",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "انا مش عارف اخسس الجناب خالص",
    "ground_truth": "Spot Fat Reduction\", الجسم ذكي و مش بيخس من منطقة محددة. اماكن تخزين الدهون في الجسم بتكون مبنية علي الجينات. وقت التنشيف الشخص بيزل دهون من كل جسمه و علشان كده مع مرور الوقت الشخص بيلاق وشه خس. علميا مفيش نظام دايت او تمرين يخلي الشخص يخس من منطقة معينة, لكن هو بيخس من جسمه كله و مع مرور الوقت شكله كله بيتغير لحد ما يوصل لهدفه. بالنسبة للبنات، مفيش تمارين اسمها نحت الجسم او Toning ، انما لشد الجسم يفضل المبني علي نظام غذائي بعجز سعرات حرارية لخسارة الدهون مع التمرين بشدة متطورة لبناء الكتلة العضلية للوصول لهدف شد الجسم. ## هل لازم اخد مكملات؟ لا، المكملات هي وسيلة تساعدك انك تكمل و توصل لاحتياجات جسمك اليومية لو انت مش قادر توفرها من الاكل. انما لو بتدخل احتياجاتك كلها وقتها اهمية المكملات بتقل. ## هل ممكن اخد حارق دهون و معملش دايت؟ حوارق الدهون مش حل سحري لخسارة الوزن، اول و اهم شيء هو الالتزام علي نظام غذائي بعجز سعرات حرارية. وقتها حارق الدهون ممكن يساعدك في اخر فترة التنشيف كورقة اخيرة تستخدمها علشان هو مش هيحسن نتايجك بغير ١٠% كحد اقصي، كمان لازم تكون عارف ان مشاكله كتير زي زيادة نبضات القلب، زيادة ضغط الدم و زيادة الارق. ## هل لازم اوزن اكلي؟ ايوه، من اهم ادوات الدايت هي ميزان الاكل و ده لدقة الكميات المستخدمة. لو مش ماشي علي ميزان اكل في الغالب نظامك الغذائي هيفشل بسبب استخدام مقادير غير محددة مما يقلل في دقة حساب السعرات. ## اوزن اكلي قبل ولا بعد الطبخ؟ يفضل توزن اي مصدر نشويات قبل الطبخ علشان الكمية بعد الطبخ بتختلف على اساس كمية المياه المستخدمة. يفضل توزن اي مصدر بروتين بعد الطبخ علشان مصادر البروتين بتخسر نسبة من وزنها في صورة مياه. ## ازاي احسب سعرات الاكل اللي باكله علي الموبايل؟ تقدر تستخدم كذه تطبيق زي MyFitnessPal او Fat Secret. لكن علشان فيه ناس كتير مش بتعرف ازاي تستخدمهم فتقدر تشوف الفيديو ده و الفيديو ده للتطبيق العملي. # تعمل ايه وقت ال Cravings ؟ طبيعي في اوقات تلاقي ان نفسك تاكل حاجة مختلفة او اكل برة الدايت، لازم تكون عارف ازاي تتعامل مع المواقف دي علشان متبوظش الدايت بتاعك و في نفس الوقت متحرمش نفسك، فخليني اقولك شوية نصائح تتعامل بيها في المواقف دي. 1. خليك عارف ان البيئة اللي حواليك ليها تاثير قوي عليك. بمعني ان لو انت كل الحلويات قدامك في المطبخ طول الوقت، طبيعي يكون نفسك تدوق منهم شوية و لو حسيت انك محروم منهم ممكن تبوظ خالص و تفشل في انك تكمل الدايت. 2. خدت بالك من كلمة حرمان اللي كتبتهالك في اول نقطة؟ مينفعش تخلي الدايت بتاعك من اكل انت مش بتحبه او التنويع فيه قليل جدا، حاول تخلي الدايت فيه تنويع و تقدر تدخل فيه اكل انت بتحبه. ممكن تمشي علي نظام غذائي مرن بحيث تقدر تستخدم ٢٠٪ من سعراتك اليومية في سناك انت بتحبها لكن بشرط انك تكون ظابط سعراتك و بتدخل احتياجك اليومي من البروتين. 3. اتاكد انك بتشرب مياه بصورة كويسة، العطش في اوقات بيتم ترجمته من جسمك ليك اكنه جوع و تحس بشراهة في الاكل. 4. قلة النوم بياثر علي مستوي هورمونات الجوع و الشبع عندك (Leptin & Ghrelin) و اكيد ده هياثر عليك، فحاول تنام عدد ساعات كافي. 5. حاول تكون مخطط يومك من الاول و عارف ايه هي وجباتك اللي مفروض تاكلها. العشوائية و انك تسيب نفسك للحظتها اكيد هتزود من فرص تبويط الدايت و التراهة في الاكل. 6. ممكن تاكل فاكهة قليلة في السعرات زي الفراولة، البطيخ، الكنتالوب والاناناس بعدها تستني نصف ساعة قبل ما تفكر تطلب اكل او تاكل لحظية. هتلاقي التراهة للحلويات اللي جسمك اتعود عليها اقل و مش هتحتاج تبوظ الدايت. 7. ممكن لو خلاص طلبت اكل تشرب مياه او تاكل طبق سلطة قبله بحيث يملي بطنك شوية و تلاقي نفسك مش بتاكل كميات كبيرة و تدخل سعرات حرارية عالية. # كلمة اخيرة لو وصلت لهنا فاحب اشكرك انك كنت مهتم تعرف كل معلومة حاولت افيدك بيها حاليا انت عندك كم معلومات قوي جدا في كل المواضيع المتعلقة بالتغذية بحيث تقدر تستفاد و تفيد بيها غيرك. مستني اعرف رايك بعد ما تخلص الكتاب و منتظر منك التزام في مشوار اوعدك هيبقي اسهل كثير بالمتابعة و النظام المبني علي احتياجك و اسلوب حياتك. جاهز تبتدي؟ يلا بينا نعمل حاجة قوية مع بعض!",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "اوزن اكلي قبل ولا بعد الطبخ?",
    "ground_truth": "بعد الطبخ؟ يفضل توزن اي مصدر نشويات قبل الطبخ علشان الكمية بعد الطبخ بتختلف على اساس كمية المياه المستخدمة. يفضل توزن اي مصدر بروتين بعد الطبخ علشان مصادر البروتين بتخسر نسبة من وزنها في صورة مياه. ## ازاي احسب سعرات الاكل اللي باكله علي الموبايل؟ تقدر تستخدم كذه تطبيق زي MyFitnessPal او Fat Secret. لكن علشان فيه ناس كتير مش بتعرف ازاي تستخدمهم فتقدر تشوف الفيديو ده و الفيديو ده للتطبيق العملي. # تعمل ايه وقت ال Cravings ؟ طبيعي في اوقات تلاقي ان نفسك تاكل حاجة مختلفة او اكل برة الدايت، لازم تكون عارف ازاي تتعامل مع المواقف دي علشان متبوظش الدايت بتاعك و في نفس الوقت متحرمش نفسك، فخليني اقولك شوية نصائح تتعامل بيها في المواقف دي. 1. خليك عارف ان البيئة اللي حواليك ليها تاثير قوي عليك. بمعني ان لو انت كل الحلويات قدامك في المطبخ طول الوقت، طبيعي يكون نفسك تدوق منهم شوية و لو حسيت انك محروم منهم ممكن تبوظ خالص و تفشل في انك تكمل الدايت. 2. خدت بالك من كلمة حرمان اللي كتبتهالك في اول نقطة؟ مينفعش تخلي الدايت بتاعك من اكل انت مش بتحبه او التنويع فيه قليل جدا، حاول تخلي الدايت فيه تنويع و تقدر تدخل فيه اكل انت بتحبه. ممكن تمشي علي نظام غذائي مرن بحيث تقدر تستخدم ٢٠٪ من سعراتك اليومية في سناك انت بتحبها لكن بشرط انك تكون ظابط سعراتك و بتدخل احتياجك اليومي من البروتين. 3. اتاكد انك بتشرب مياه بصورة كويسة، العطش في اوقات بيتم ترجمته من جسمك ليك اكنه جوع و تحس بشراهة في الاكل. 4. قلة النوم بياثر علي مستوي هورمونات الجوع و الشبع عندك (Leptin & Ghrelin) و اكيد ده هياثر عليك، فحاول تنام عدد ساعات كافي. 5. حاول تكون مخطط يومك من الاول و عارف ايه هي وجباتك اللي مفروض تاكلها. العشوائية و انك تسيب نفسك للحظتها اكيد هتزود من فرص تبويط الدايت و التراهة في الاكل. 6. ممكن تاكل فاكهة قليلة في السعرات زي الفراولة، البطيخ، الكنتالوب والاناناس بعدها تستني نصف ساعة قبل ما تفكر تطلب اكل او تاكل لحظية. هتلاقي التراهة للحلويات اللي جسمك اتعود عليها اقل و مش هتحتاج تبوظ الدايت. 7. ممكن لو خلاص طلبت اكل تشرب مياه او تاكل طبق سلطة قبله بحيث يملي بطنك شوية و تلاقي نفسك مش بتاكل كميات كبيرة و تدخل سعرات حرارية عالية. # كلمة اخيرة لو وصلت لهنا فاحب اشكرك انك كنت مهتم تعرف كل معلومة حاولت افيدك بيها حاليا انت عندك كم معلومات قوي جدا في كل المواضيع المتعلقة بالتغذية بحيث تقدر تستفاد و تفيد بيها غيرك. مستني اعرف رايك بعد ما تخلص الكتاب و منتظر منك التزام في مشوار اوعدك هيبقي اسهل كثير بالمتابعة و النظام المبني علي احتياجك و اسلوب حياتك. جاهز تبتدي؟ يلا بينا نعمل حاجة قوية مع بعض!",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "في application احسب بيها سعرات الاكل?",
    "ground_truth":"MyFitnessPal او Fat Secret.",
    "docsource": "nutrition_ebook"
  },
  {
    "question": "انا هموت و اكل حاجه مسكره",
    "ground_truth":"# تعمل ايه وقت ال Cravings ؟ طبيعي في اوقات تلاقي ان نفسك تاكل حاجة مختلفة او اكل برة الدايت، لازم تكون عارف ازاي تتعامل مع المواقف دي علشان متبوظش الدايت بتاعك و في نفس الوقت متحرمش نفسك، فخليني اقولك شوية نصائح تتعامل بيها في المواقف دي. 1. خليك عارف ان البيئة اللي حواليك ليها تاثير قوي عليك. بمعني ان لو انت كل الحلويات قدامك في المطبخ طول الوقت، طبيعي يكون نفسك تدوق منهم شوية و لو حسيت انك محروم منهم ممكن تبوظ خالص و تفشل في انك تكمل الدايت. 2. خدت بالك من كلمة حرمان اللي كتبتهالك في اول نقطة؟ مينفعش تخلي الدايت بتاعك من اكل انت مش بتحبه او التنويع فيه قليل جدا، حاول تخلي الدايت فيه تنويع و تقدر تدخل فيه اكل انت بتحبه. ممكن تمشي علي نظام غذائي مرن بحيث تقدر تستخدم ٢٠٪ من سعراتك اليومية في سناك انت بتحبها لكن بشرط انك تكون ظابط سعراتك و بتدخل احتياجك اليومي من البروتين. 3. اتاكد انك بتشرب مياه بصورة كويسة، العطش في اوقات بيتم ترجمته من جسمك ليك اكنه جوع و تحس بشراهة في الاكل. 4. قلة النوم بياثر علي مستوي هورمونات الجوع و الشبع عندك (Leptin & Ghrelin) و اكيد ده هياثر عليك، فحاول تنام عدد ساعات كافي. 5. حاول تكون مخطط يومك من الاول و عارف ايه هي وجباتك اللي مفروض تاكلها. العشوائية و انك تسيب نفسك للحظتها اكيد هتزود من فرص تبويط الدايت و التراهة في الاكل. 6. ممكن تاكل فاكهة قليلة في السعرات زي الفراولة، البطيخ، الكنتالوب والاناناس بعدها تستني نصف ساعة قبل ما تفكر تطلب اكل او تاكل لحظية. هتلاقي التراهة للحلويات اللي جسمك اتعود عليها اقل و مش هتحتاج تبوظ الدايت. 7. ممكن لو خلاص طلبت اكل تشرب مياه او تاكل طبق سلطة قبله بحيث يملي بطنك شوية و تلاقي نفسك مش بتاكل كميات كبيرة و تدخل سعرات حرارية عالية.",
    "docsource": "nutrition_ebook"
  }
]